IdeaRS.OpenModel.Model.RigidLink
Rigid link between nodes

IdeaRS.OpenModel.Model.RigidLink.MasterNode
Node to which all six independent
degrees of freedom for the element are assigned

IdeaRS.OpenModel.Model.RigidLink.SlaveNodes
Dependent nodes

IdeaRS.OpenModel.Model.RigidLink.RigidRX
DOF rigid in RX dirrection

IdeaRS.OpenModel.Model.RigidLink.RigidRY
DOF rigid in RY dirrection

IdeaRS.OpenModel.Model.RigidLink.RigidRZ
DOF rigid in RZ dirrection

IdeaRS.OpenModel.Model.RigidLink.RigidX
DOF rigid in X dirrection

IdeaRS.OpenModel.Model.RigidLink.RigidY
DOF rigid in Y dirrection

IdeaRS.OpenModel.Model.RigidLink.RigidZ
DOF rigid in Z dirrection